# ConnectionInputPointInfo Class

---
An object that holds description information about a connection input point
SystemObject Autodesk.Revit.DB.StructureConnectionInputPointInfo
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ConnectionInputPointInfo : IDisposable

    Public Class ConnectionInputPointInfo
    	Implements IDisposable

    public ref class ConnectionInputPointInfo : IDisposable

    type ConnectionInputPointInfo =
        class
            interface IDisposable
        end
The ConnectionInputPointInfo type exposes the following members.
| Name| Description
---|---|---
| ConnectionInputPointInfo|  Construct a default input point.
| ConnectionInputPointInfo(String, Int32, String)|  Construct an input point info.
Top
| Name| Description
---|---|---
| InputMemberIndex|  A index of the input member to which the restriction applies.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| PointSelectionText|  A string used to select input point by some connections.
| RestrictionType|  A type of input point restriction.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ConnectionInputPointInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace